import os, re
import fnmatch

kanji_string = "一 二 三 四 五 六 七 八 九 十 百 千 上 下 左 右 中 大 小 月 日 年 早 木 林 山 川 土 空 田 天 生 花 草 虫 犬 人 名 女 男 子 目 耳 口 手 足 見 音 力 気 円 入 出 立 休 先 夕 本 文 字 学 校 村 町 森 正 水 火 王 玉 石 竹 糸 貝 車 金 雨 赤 青 白".strip(" ")
kanji_string += "数 多 少 万 半 形 太 細 広 長 点 丸 交 光 角 計 直 線 矢 弱 強 高 同 親 母 父 姉 兄 弟 妹 自 友 体 毛 頭 顔 首 心 時 曜 朝 昼 夜 分 週 春 夏 秋 冬 今 新 古 間 方 北 南 東 西 遠 近 前 後 内 外 場 地 国 園 谷 野 原 里 市 京 風 雪 雲 池 海 岩 星 室 戸 家 寺 通 門 道 話 言 答 声 聞 語 読 書 記 紙 画 絵 図 工 教 晴 思 考 知 才 理 算 作 元 食 肉 馬 牛 魚 鳥 羽 鳴 麦 米 茶 色 黄 黒 来 行 帰 歩 走 止 活 店 買 売 午 汽 弓 回 会 組 船 明 社 切 電 毎 合 当 台 楽 公 引 科 歌 刀 番 用 何 丁".strip(" ")
kanji_string += "世 両 主 乗 予 事 仕 他 代 住 使 係 倍 全 具 写 列 助 勉 動 勝 化 区 医 去 反 取 受 号 向 君 味 命 和 品 員 商 問 坂 央 始 委 守 安 定 実 客 宮 宿 寒 対 局 屋 岸 島 州 帳 平 幸 度 庫 庭 式 役 待 急 息 悪 悲 想 意 感 所 打 投 拾 持 指 放 整 旅 族 昔 昭 暑 暗 曲 有 服 期 板 柱 根 植 業 様 横 橋 次 歯 死 氷 決 油 波 注 泳 洋 流 消 深 温 港 湖 湯 漢 炭 物 球 由 申 界 畑 病 発 登 皮 皿 相 県 真 着 短 研 礼 神 祭 福 秒 究 章 童 笛 第 筆 等 箱 級 終 緑 練 羊 美 習 者 育 苦 荷 落 葉 薬 血 表 詩 調 談 豆 負 起 路 身 転 軽 農 返 追 送 速 進 遊 運 部 都 配 酒 重 鉄 銀 開 院 陽 階 集 面 題 飲 館 駅 鼻".strip(" ")
kanji_string += "不 争 付 令 以 仲 伝 位 低 例 便 信 倉 候 借 停 健 側 働 億 兆 児 共 兵 典 冷 初 別 利 刷 副 功 加 努 労 勇 包 卒 協 単 博 印 参 史 司 各 告 周 唱 喜 器 囲 固 型 堂 塩 士 変 夫 失 好 季 孫 完 官 害 察 巣 差 希 席 帯 底 府 康 建 径 徒 得 必 念 愛 成 戦 折 挙 改 救 敗 散 料 旗 昨 景 最 望 未 末 札 材 束 松 果 栄 案 梅 械 極 標 機 欠 歴 残 殺 毒 氏 民 求 治 法 泣 浅 浴 清 満 漁 灯 無 然 焼 照 熱 牧 特 産 的 省 祝 票 種 積 競 笑 管 節 粉 紀 約 結 給 続 置 老 胃 脈 腸 臣 航 良 芸 芽 英 菜 街 衣 要 覚 観 訓 試 説 課 議 象 貨 貯 費 賞 軍 輪 辞 辺 連 達 選 郡 量 録 鏡 関 陸 隊 静 順 願 類 飛 飯 養 験".strip(" ")
kanji_string += "久 仏 仮 件 任 似 余 価 保 修 俵 個 備 像 再 刊 判 制 券 則 効 務 勢 厚 句 可 営 因 団 圧 在 均 基 報 境 墓 増 夢 妻 婦 容 寄 富 導 居 属 布 師 常 幹 序 弁 張 往 復 徳 志 応 快 性 恩 情 態 慣 承 技 招 授 採 接 提 損 支 政 故 敵 断 旧 易 暴 条 枝 査 格 桜 検 構 武 比 永 河 液 混 減 測 準 演 潔 災 燃 版 犯 状 独 率 現 留 略 益 眼 破 確 示 祖 禁 移 程 税 築 精 素 経 統 絶 綿 総 編 績 織 罪 群 義 耕 職 肥 能 興 舌 舎 術 衛 製 複 規 解 設 許 証 評 講 謝 識 護 豊 財 貧 責 貸 貿 賀 資 賛 質 輸 述 迷 退 逆 造 過 適 酸 鉱 銅 銭 防 限 険 際 雑 非 預 領 額 飼".strip(" ")
kanji_string += "並 乱 乳 亡 仁 供 俳 値 傷 優 党 冊 処 刻 割 創 劇 勤 危 卵 厳 収 后 否 吸 呼 善 困 垂 城 域 奏 奮 姿 存 孝 宅 宇 宗 宙 宝 宣 密 寸 専 射 将 尊 就 尺 届 展 層 己 巻 幕 干 幼 庁 座 延 律 従 忘 忠 憲 我 批 担 拝 拡 捨 探 推 揮 操 敬 映 晩 暖 暮 朗 机 枚 染 株 棒 模 権 樹 欲 段 沿 泉 洗 派 済 源 潮 激 灰 熟 片 班 異 疑 痛 皇 盛 盟 看 砂 磁 私 秘 穀 穴 窓 筋 策 簡 糖 系 紅 納 純 絹 縦 縮 署 翌 聖 肺 背 胸 脳 腹 臓 臨 至 若 著 蒸 蔵 蚕 衆 裁 装 裏 補 視 覧 討 訪 訳 詞 誌 認 誕 誠 誤 論 諸 警 貴 賃 遺 郵 郷 針 鋼 閉 閣 降 陛 除 障 難 革 頂 骨".strip(" ")
kanji_string += "哀 挨 曖 握 扱 宛 嵐 依 威 為 畏 尉 萎 偉 椅 彙 違 維 慰 緯 壱 逸 茨 芋 咽 姻 淫 陰 隠 韻 唄 鬱 畝 浦 詠 影 鋭 疫 悦 越 謁 閲 炎 怨 宴 媛 援 煙 猿 鉛 縁 艶 汚 凹 押 旺 欧 殴 翁 奥 岡 憶 臆 虞 乙 俺 卸 穏 佳 苛 架 華 菓 渦 嫁 暇 禍 靴 寡 箇 稼 蚊 牙 瓦 雅 餓 介 戒 怪 拐 悔 皆 塊 楷 潰 壊 懐 諧 劾 崖 涯 慨 蓋 該 概 骸 垣 柿 核 殻 郭 較 隔 獲 嚇 穫 岳 顎 掛 潟 括 喝 渇 葛 滑 褐 轄 且 釜 鎌 刈 甘 汗 缶 肝 冠 陥 乾 勘 患 貫 喚 堪 換 敢 棺 款 閑 勧 寛 歓 監 緩 憾 還 環 韓 艦 鑑 含 玩 頑 企 伎 岐 忌 奇 祈 軌 既 飢 鬼 亀 幾 棋 棄 毀 畿 輝 騎 宜 偽 欺 儀 戯 擬 犠 菊 吉 喫 詰 却 脚 虐 及 丘 朽 臼 糾 嗅 窮 巨 拒 拠 虚 距 御 凶 叫 狂 享 況 峡 挟 狭 恐 恭 脅 矯 響 驚 仰 暁 凝 巾 斤 菌 琴 僅 緊 錦 謹 襟 吟 駆 惧 愚 偶 遇 隅 串 屈 掘 窟 熊 繰 勲 薫 刑 茎 契 恵 啓 掲 渓 蛍 傾 携 継 詣 慶 憬 稽 憩 鶏 迎 鯨 隙 撃 桁 傑 肩 倹 兼 剣 拳 軒 圏 堅 嫌 献 遣 賢 謙 鍵 繭 顕 懸 幻 玄 弦 舷 股 虎 孤 弧 枯 雇 誇 鼓 錮 顧 互 呉 娯 悟 碁 勾 孔 巧 甲 江 坑 抗 攻 更 拘 肯 侯 恒 洪 荒 郊 香 貢 控 梗 喉 慌 硬 絞 項 溝 綱 酵 稿 衡 購 乞 拷 剛 傲 豪 克 酷 獄 駒 込 頃 昆 恨 婚 痕 紺 魂 墾 懇 佐 沙 唆 詐 鎖 挫 采 砕 宰 栽 彩 斎 債 催 塞 歳 載 埼 剤".strip(" ")
kanji_string += "崎 削 柵 索 酢 搾 錯 咲 刹 拶 撮 擦 桟 惨 傘 斬 暫 旨 伺 刺 祉 肢 施 恣 脂 紫 嗣 雌 摯 賜 諮 侍 滋 慈 餌 璽 鹿 軸 𠮟 疾 執 湿 嫉 漆 芝 赦 斜 煮 遮 邪 蛇 酌 釈 爵 寂 朱 狩 殊 珠 腫 趣 寿 呪 需 儒 囚 舟 秀 臭 袖 羞 愁 酬 醜 蹴 襲 汁 充 柔 渋 銃 獣 叔 淑 粛 塾 俊 瞬 旬 巡 盾 准 殉 循 潤 遵 庶 緒 如 叙 徐 升 召 匠 床 抄 肖 尚 昇 沼 宵 症 祥 称 渉 紹 訟 掌 晶 焦 硝 粧 詔 奨 詳 彰 憧 衝 償 礁 鐘 丈 冗 浄 剰 畳 縄 壌 嬢 錠 譲 醸 拭 殖 飾 触 嘱 辱 尻 伸 芯 辛 侵 津 唇 娠 振 浸 紳 診 寝 慎 審 震 薪 刃 尽 迅 甚 尋 腎 須 吹 炊 帥 粋 衰 酔 遂 睡 穂 随 髄 枢 崇 据 杉 裾 瀬 是 井 姓 征 斉 牲 凄 逝 婿 誓 請 醒 斥 析 脊 隻 惜 戚 跡 籍 拙 窃 摂 仙 占 扇 栓 旋 煎 羨 腺 詮 践 箋 潜 遷 薦 繊 鮮 禅 漸 膳 繕 狙 阻 租 措 粗 疎 訴 塑 遡 礎 双 壮 荘 捜 挿 桑 掃 曹 曽 爽 喪 痩 葬 僧 遭 槽 踪 燥 霜 騒 藻 憎 贈 即 促 捉 俗 賊 遜 汰 妥 唾 堕 惰 駄 耐 怠 胎 泰 堆 袋 逮 替 滞 戴 滝 択 沢 卓 拓 託 濯 諾 濁 但 脱 奪 棚 誰 丹 旦 胆 淡 嘆 端 綻 鍛 弾 壇 恥 致 遅 痴 稚 緻 畜 逐 蓄 秩 窒 嫡 沖 抽 衷 酎 鋳 駐 弔 挑 彫 眺 釣 貼 超 跳 徴 嘲 澄 聴 懲 勅 捗 沈 珍 朕 陳 鎮 椎 墜 塚 漬 坪 爪 鶴 呈 廷 抵 邸 亭 貞 帝 訂 逓 偵 堤 艇 締 諦 泥 摘 滴 溺 迭".strip(" ")
kanji_string += "哲 徹 撤 添 塡 殿 斗 吐 妬 途 渡 塗 賭 奴 怒 到 逃 倒 凍 唐 桃 透 悼 盗 陶 塔 搭 棟 痘 筒 稲 踏 謄 藤 闘 騰 洞 胴 瞳 峠 匿 督 篤 栃 凸 突 屯 豚 頓 貪 鈍 曇 丼 那 奈 梨 謎 鍋 軟 尼 弐 匂 虹 尿 妊 忍 寧 捻 粘 悩 濃 把 覇 婆 罵 杯 排 廃 輩 培 陪 媒 賠 伯 拍 泊 迫 剝 舶 薄 漠 縛 爆 箸 肌 鉢 髪 伐 抜 罰 閥 氾 帆 汎 伴 阪 畔 般 販 斑 搬 煩 頒 範 繁 藩 蛮 盤 妃 彼 披 卑 疲 被 扉 碑 罷 避 尾 眉 微 膝 肘 匹 泌 姫 漂 苗 描 猫 浜 賓 頻 敏 瓶 扶 怖 阜 附 訃 赴 浮 符 普 腐 敷 膚 賦 譜 侮 舞 封 伏 幅 覆 払 沸 紛 雰 噴 墳 憤 丙 併 柄 塀 幣 弊 蔽 餅 壁 璧 癖 蔑 偏 遍 哺 捕 舗 募 慕 簿 芳 邦 奉 抱 泡 胞 俸 倣 峰 砲 崩 蜂 飽 褒 縫 乏 忙 坊 妨 房 肪 某 冒 剖 紡 傍 帽 貌 膨 謀 頰 朴 睦 僕 墨 撲 没 勃 堀 奔 翻 凡 盆 麻 摩 磨 魔 昧 埋 膜 枕 又 抹 慢 漫 魅 岬 蜜 妙 眠 矛 霧 娘 冥 銘 滅 免 麺 茂 妄 盲 耗 猛 網 黙 紋 冶 弥 厄 躍 闇 喩 愉 諭 癒 唯 幽 悠 湧 猶 裕 雄 誘 憂 融 与 誉 妖 庸 揚 揺 溶 腰 瘍 踊 窯 擁 謡 抑 沃 翼 裸 羅 雷 頼 絡 酪 辣 濫 藍 欄 吏 痢 履 璃 離 慄 柳 竜 粒 隆 硫 侶 虜 慮 了 涼 猟 陵 僚 寮 療 瞭 糧 厘 倫 隣 瑠 涙 累 塁 励 戻 鈴 零 霊 隷 齢 麗 暦 劣 烈 裂 恋 廉 錬 呂 炉 賂 露 弄 郎 浪 廊 楼 漏 籠 麓 賄 脇 惑 枠 湾 腕 濡 嘘 賑 剃 喧 嘩 叩 噛 姪 苺 逢 糊 鋏 鞄 飴 揃 噂 賑 蝶 漕 鳩 囁 咳 吊 屑 掻 撫 汲 溜 遥 焚 詫 釘 錆 騙 雀 甥 炒 嬉".strip(" ")


print (len(kanji_string.decode('utf-8')) / 2)

for filename in os.listdir("kanji/"):
  if (filename == ".DS_Store"):
    continue
  if fnmatch.fnmatch(filename, "*-*"):
    print ("unneeded/" + filename) 
    os.rename("kanji/" + filename, "unneeded/" + filename)

  filename_noext = re.sub(r'\.[^\.]+$','',filename)
  filename_escape = filename_noext.decode('unicode-escape')

  filename_kanji = unichr(int(filename_escape, 16))
  filename_utf = filename_kanji.encode("utf-8")

  if not filename_utf in kanji_string:
    os.rename("kanji/" + filename, "unneeded/" + filename)
  else:
    print("Need " + filename_kanji)
    kanji_string = kanji_string.replace(filename_utf, '')

print("Needed kanji: " + kanji_string.strip(" "))

  
